/*
 * 写出下列表达式的求值结果。
 *
 * (a) -30 * 3 + 21 / 5    (b) -30 + 3 * 21 / 5
 * (c) 30 / 3 * 21 % 5     (d) -30 / 3 * 21 % 4
 */


/*
 * (a) 15          (b) -18 (-30 + 12)
 * (c) 0           (d) -2
 */

#include <iostream>

int main(void) {
    //a
    std::cout << "-30 * 3 + 21 / 5 = " << -30 * 3 + 21 / 5 << std::endl;

    //b
    std::cout << "-30 + 3 * 21 / 5 = " << -30 + 3 * 21 / 5 << std::endl;

    //c
    std::cout << "30 / 3 * 21 % 5 = " << 30 / 3 * 21 % 5 << std::endl;

    //d
    std::cout << "-30 / 3 * 21 % 4 = " << -30 / 3 * 21 % 4 << std::endl;
    return 0;
}
